pagename_viewId = [
    ['B2B_THP平台', '174271738'],
    ['IBMI+B2B', '252172811'],
    ['Taiwan Healthcare+(全)生策會', '140828653'],
    ['THP_portal+Expo', '175823907'],
    ['台灣醫療科技展', '171624169'],
    ['展會(專業版)+B2B', '238749290'],
    ['展會網站(專業版)', '228873130'],
    ['展會網站(民眾版)', '228869197'],
    ['新創獎', '175343921'],
    ['生策會(IBMI)', '172357679'],
    ['snq主帳戶(包含手機版和電腦版)', '43091365'],
    ['snq手機版', '95522793'],
    ['snq電腦版', '95545135'],
    ['健康優購網', '74204970']
]
print(pagename_viewId[0][0])
