import pandas as pd
from os.path import dirname, abspath

pwd = dirname(abspath(__file__)).replace('\\', '/')


class Df:
    def __init__(self, df):
        self.df = df

    def delRow(self, condition):
        self.df = self.df[~(self.df.v3.str.contains(condition['v3']) & self.df.v5.str.contains(condition['v5']) & self.df.v6.str.contains(condition['v6']))]

    def addRow(self, row):
        self.df = pd.concat([self.df, pd.DataFrame({'v1': [row[0]], 'v2': [row[1]], 'v3': [row[2]], 'v4': [row[3]], 'v5': [row[4]], 'v6': [row[5]], 'v7': [row[6]], 'v8': [row[7]], 'v9': [row[8]]})], ignore_index=True, axis=0)

    def repRow(self, condition):
        self.df.loc[(self.df.v3.str.contains(condition['v3']) & self.df.v5.str.contains(condition['v5']) & self.df.v6.str.contains(condition['v6'])), 'v5'] = condition['rep']
        self.df.loc[(self.df.v3.str.contains(condition['v3']) & self.df.v5.str.contains(condition['rep']) & self.df.v6.str.contains(condition['v6'])), 'v7'] = condition['v7']
        self.df.loc[(self.df.v3.str.contains(condition['v3']) & self.df.v5.str.contains(condition['rep']) & self.df.v6.str.contains(condition['v6'])), 'v8'] = condition['v8']


delete = [
    {'v3': '中國醫藥大學', 'v5': '江宏哲', 'v6': '副校長'},
    {'v3': '中州學校財團法人中州科技大學', 'v5': '黃思倫', 'v6': '校長'},
    {'v3': '中華大學學校財團法人中華大學', 'v5': '鄭藏勝', 'v6': '副校長'},
    {'v3': '中華學校財團法人中華科技大學', 'v5': '謝宏榮', 'v6': '副校長'},
    {'v3': '元智大學', 'v5': '林志民', 'v6': '副校長'},
    {'v3': '台北海洋學校財團法人台北海洋科技大學', 'v5': '陳合成', 'v6': '副校長'},
    {'v3': '嘉藥學校財團法人嘉南藥理大學', 'v5': '余光昌', 'v6': '副校長'},
    {'v3': '國立中央大學', 'v5': '李光華', 'v6': '副校長'},
    {'v3': '國立中山大學', 'v5': '黃義佑', 'v6': '副校長'},
    {'v3': '國立中興大學', 'v5': '黃振文', 'v6': '副校長'},
    {'v3': '國立清華大學', 'v5': '陳信文', 'v6': '副校長'},
    {'v3': '國立臺中教育大學', 'v5': '王曉璿', 'v6': '副校長'},
    {'v3': '國立臺北大學', 'v5': '吳泰熙', 'v6': '副校長'},
    {'v3': '國立臺灣海洋大學', 'v5': '張志清', 'v6': '副校長'},
    {'v3': '國立臺灣海洋大學', 'v5': '李明安', 'v6': '副校長'},
    {'v3': '國立高雄科技大學', 'v5': '郭俊賢', 'v6': '研究發展處研發長'},
    {'v3': '大華學校財團法人敏實科技大學', 'v5': '顏振輝', 'v6': '副校長'},
    {'v3': '大葉大學', 'v5': '葉忠興', 'v6': '副校長'},
    {'v3': '實踐大學', 'v5': '江岷欽', 'v6': '副校長'},
    {'v3': '弘光科技大學', 'v5': '易光輝', 'v6': '副校長'},
    {'v3': '慈惠醫護管理專科學校', 'v5': '郭威伯', 'v6': '副校長'},
    {'v3': '東海大學', 'v5': '王立志', 'v6': '副校長'},
    {'v3': '樹人醫護管理專科學校', 'v5': '陳明堂', 'v6': '副校長'},
    {'v3': '淡江大學學校財團法人淡江大學', 'v5': '林志鴻', 'v6': '副校長'},
    {'v3': '環球學校財團法人環球科技大學', 'v5': '丁一倫', 'v6': '研究發展處研發長'},
    {'v3': '經國管理暨健康學院', 'v5': '吳文欽', 'v6': '副校長'},
    {'v3': '聖約翰科技大學', 'v5': '張文宇', 'v6': '副校長'},
    {'v3': '華夏學校財團法人華夏科技大學', 'v5': '蘇聖珠', 'v6': '副校長'},
    {'v3': '逢甲大學', 'v5': '邱創乾', 'v6': '副校長'},
    {'v3': '銘傳大學', 'v5': '顏善邦', 'v6': '副校長'},
    {'v3': '靜宜大學', 'v5': '王俊權', 'v6': '副校長'},
    {'v3': '黎明技術學院', 'v5': '徐秀惠', 'v6': '副校長'},
]


add = [
    ['私立', '技專校院', '黎明技術學院', '24305 新北市泰山區泰林路三段22號', '王士賓', '研究發展處研發長', '02-2909-7811#1532', 'yuchin@mail.lit.edu.tw', 'http://www.lit.edu.tw/'],
    ['私立', '一般大學', '靜宜大學', '43301 臺中市沙鹿區中棲路200號(臺中市沙鹿區臺灣大道7段200號)', '楊昭順', '副校長', '04-2632-8001#11030', 'chyang@pu.edu.tw', 'https://www.pu.edu.tw'],
    ['私立', '一般大學', '靜宜大學', '43301 臺中市沙鹿區中棲路200號(臺中市沙鹿區臺灣大道7段200號)', '江善宗', '副校長', '04-2632-8001#15375', 'stjiang@pu.edu.tw', 'https://www.pu.edu.tw'],
    ['私立', '一般大學', '臺北醫學大學', '11031 臺北市信義區吳興街250號', '吳麥斯', '副校長', '', '', 'http://www.tmu.edu.tw'],
    ['私立', '技專校院', '美和學校財團法人美和科技大學', '91202 屏東縣內埔鄉美和村屏光路23號', '苑梅俊', '研究發展處研發長', '08-779-1030#8527', 'x00002217@meiho.edu.tw', 'https://www.meiho.edu.tw/'],
    ['私立', '技專校院', '經國管理暨健康學院', '203301 基隆市中山區復興路336號', '藍文謙', '研究發展處研發長', '02-2437-2093#610', 'jameslan@ems.cku.edu.tw', 'http://www.cku.edu.tw'],
    ['私立', '一般大學', '淡江大學學校財團法人淡江大學', '25137 新北市淡水區英專路151號|10650 台北市大安區金華街199巷5號|26247 宜蘭縣礁溪鄉林美村林尾路180號', '薛宏中', '研究發展處研發長', '02-2623-6932#2100', '', 'http://www.tku.edu.tw'],
    ['私立', '一般大學', '東海大學', '40704 臺中市西屯區臺灣大道4段1727號', '劉正', '副校長', '04-2359-0121#21801', 'jliu@thu.edu.tw', 'http://www.thu.edu.tw'],
    ['私立', '一般大學', '東海大學', '40704 臺中市西屯區臺灣大道4段1727號', '張嘉修', '副校長', '04-2359-0121#30132', 'changjs@mail.ncku.edu.tw', 'http://www.thu.edu.tw'],
    ['公立', '技專校院', '國立高雄科技大學', '80778 高雄市三民區建工路415號|82445 高雄市燕巢區大學路1號|81157 高雄市楠梓區海專路142號|80543 高雄市旗津區中洲三路482號|82444 高雄市燕巢區深中路58號', '謝淑玲', '副校長', '07-601-1000#31100', '', 'http://www.nkust.edu.tw/'],
    ['公立', '技專校院', '國立高雄科技大學', '80778 高雄市三民區建工路415號|82445 高雄市燕巢區大學路1號|81157 高雄市楠梓區海專路142號|80543 高雄市旗津區中洲三路482號|82444 高雄市燕巢區深中路58號', '郭俊賢', '副校長', '07-601-1000#15402', '', 'http://www.nkust.edu.tw/'],
    ['公立', '技專校院', '國立高雄科技大學', '80778 高雄市三民區建工路415號|82445 高雄市燕巢區大學路1號|81157 高雄市楠梓區海專路142號|80543 高雄市旗津區中洲三路482號|82444 高雄市燕巢區深中路58號', '吳忠信', '副校長', '07-601-1000#12210', '', 'http://www.nkust.edu.tw/'],
    ['公立', '技專校院', '國立虎尾科技大學', '63201 雲林縣虎尾鎮文化路64號', '張禎元', '副校長', '05-631-5003', 'james.chang@nfu.edu.tw', 'http://www.nfu.edu.tw/'],
    ['公立', '一般大學', '國立臺灣海洋大學', '20224 基隆市北寧路2號|21042 連江縣北竿鄉坂里村59號', '李明安', '副校長', '02-2462-2192#1007', 'malee@mail.ntou.edu.tw', 'http://www.ntou.edu.tw'],
    ['公立', '一般大學', '國立臺灣海洋大學', '20224 基隆市北寧路2號|21042 連江縣北竿鄉坂里村59號', '冉繁華', '副校長', '02-2462-2192#1005', 'fhnan@mail.ntou.edu.tw', 'http://www.ntou.edu.tw'],
    ['公立', '一般大學', '國立臺灣海洋大學', '20224 基隆市北寧路2號|21042 連江縣北竿鄉坂里村59號', '顧承宇', '副校長', '02-2462-2192#6109', 'chkst26@mail.ntou.edu.tw', 'http://www.ntou.edu.tw'],
    ['私立', '一般大學', '亞洲大學', '41354 臺中市霧峰區柳豐路500號', '陳啟雄', '副校長', '04-2332-3456#1081', 'chenchs@asia.edu.tw', 'http://www.asia.edu.tw'],
    ['私立', '技專校院', '南臺學校財團法人南臺科技大學', '71005 臺南市永康區南臺街1號', '周德光', '副校長', '06-253-3131#1600', 'dkchou@stust.edu.tw', 'http://www.stust.edu.tw'],
    ['私立', '技專校院', '南開科技大學', '54243 南投縣草屯鎮中正路568號', '楊肅正', '副校長', '049-256-3489#1212', 'lcm@nkut.edu.tw', 'https://www.nkut.edu.tw/index.php'],
    ['私立', '技專校院', '嘉藥學校財團法人嘉南藥理大學', '71710 臺南市仁德區二仁路一段60號', '錢紀銘', '副校長', '06-266-4911#1020', 'box1020@mail.cnu.edu.tw', 'https://www.cnu.edu.tw/'],
    ['私立', '技專校院', '嘉藥學校財團法人嘉南藥理大學', '71710 臺南市仁德區二仁路一段60號', '蘇銘宏', '副校長', '06-266-4911#1021', 'box1021@mail.cnu.edu.tw', 'https://www.cnu.edu.tw/'],
    ['公立', '一般大學', '國立中央大學', '32001 桃園市中壢區中大路300號', '顏上堯', '副校長', '03-422-7151#57007', 't320002@cc.ncu.edu.tw', 'http://www.ncu.edu.tw'],
    ['公立', '一般大學', '國立中山大學', '80424 高雄市鼓山區蓮海路70號', '郭志文', '副校長', '07-525-2015', 'cwkuo@mail.nsysu.edu.tw', 'http://www.nsysu.edu.tw'],
    ['公立', '一般大學', '國立中山大學', '80424 高雄市鼓山區蓮海路70號', '余明隆', '副校長', '07-525-2000#2010', 'yu2022@mail.nsysu.edu.tw', 'http://www.nsysu.edu.tw'],
    ['公立', '一般大學', '國立中興大學', '40227 台中市南區興大路145號', '詹富智', '副校長', '04-2284-0537', 'fjjan@dragon.nchu.edu.tw', 'http://www.nchu.edu.tw/index1.php'],
    ['公立', '一般大學', '國立中興大學', '40227 台中市南區興大路145號', '陳適安', '副校長', '04-2284-0537', 'vice@nchu.edu.tw', 'http://www.nchu.edu.tw/index1.php'],
    ['公立', '一般大學', '國立中興大學', '40227 台中市南區興大路145號', '陳穆寬', '副校長', '04-2284-0537', 'vice@nchu.edu.tw', 'http://www.nchu.edu.tw/index1.php'],
    ['公立', '一般大學', '國立東華大學', '97401 花蓮縣壽豐鄉志學村大學路2段1號|97064 花蓮市華西路123號|94450 屏東縣車城鄉後灣村後灣路2號', '馬遠榮', '副校長', '03-890-5111', 'ronma@mail.ndhu.edu.tw', 'https://www.ndhu.edu.tw'],
    ['公立', '技專校院', '國立臺北科技大學', '10608 臺北市忠孝東路三段1號', '楊士萱', '副校長', '02-2771-2171#1091', 'shyang@mail.ntut.edu.tw', 'https://www.ntut.edu.tw/'],
    ['公立', '一般大學', '國立臺灣大學', '10617 臺北市大安區羅斯福路4段1號|10051 臺北市中正區仁愛路1段1號|10055 臺北市中正區徐州路17號|30264 新竹縣竹北市莊敬一路88號|63247 雲林縣虎尾鎮廉使里學府路95號', '羅清華', '副校長', '02-2312-3456#88799', 'ntuvpmed@ntu.edu.tw', 'https://www.ndhu.edu.tw']
]


rep = [
    {'rep': '林思伶', 'v3': '靜宜大學', 'v5': '唐傳義', 'v6': '校長', 'v7': '04-2631-0631', 'v8': 'president@pu.edu.tw'},
    {'rep': '賴信志', 'v3': '長榮大學', 'v5': '吳佩芝', 'v6': '研究發展處研發長', 'v7': '06-278-5123#1600', 'v8': 'yijiayang@mail.cjcu.edu.tw'},
    {'rep': '吳佩芝', 'v3': '長榮大學', 'v5': '孫惠民', 'v6': '副校長', 'v7': '06-278-5268#1050', 'v8': 'wupc@mail.cjcu.edu.tw'},
    {'rep': '陳純德', 'v3': '銘傳大學', 'v5': '黃博俊 代理', 'v6': '研究發展處研發長', 'v7': '02-2882-4564#2723', 'v8': 'marschen@mail.mcu.edu.tw'},
    {'rep': '林進財', 'v3': '銘傳大學', 'v5': '林進財 代理', 'v6': '副校長', 'v7': '02-2880-9701', 'v8': 'ctlin@mail.mcu.edu.tw'},
    {'rep': '李選士', 'v3': '銘傳大學', 'v5': '沈佩蒂', 'v6': '校長', 'v7': '02-2881-2549', 'v8': ''},
    {'rep': '蔡若鵬', 'v3': '遠東科技大學', 'v5': '關旭強', 'v6': '研究發展處研發長', 'v7': '06-597-9566#7275', 'v8': ''},
    {'rep': '王榮聖', 'v3': '遠東科技大學', 'v5': '王元仁', 'v6': '校長', 'v7': '06-597-9566#7187', 'v8': 'laworker@mail.feu.edu.tw'},
    {'rep': '陳錦毅', 'v3': '逢甲大學', 'v5': '吳肇展', 'v6': '研究發展處研發長', 'v7': '04-2451-7250#2090', 'v8': 'chencyi@fcu.edu.tw'},
    {'rep': '唐國豪', 'v3': '逢甲大學', 'v5': '黃錦煌', 'v6': '副校長', 'v7': '04-2451-7250#2028', 'v8': 'hlyang@fcu.edu.tw'},
    {'rep': '黎淑婷', 'v3': '逢甲大學', 'v5': '蕭堯仁', 'v6': '副校長', 'v7': '04-2451-7250#3315', 'v8': 'hywu＠fcu.edu.tw'},
    {'rep': '王葳', 'v3': '逢甲大學', 'v5': '李秉乾', 'v6': '校長', 'v7': '04-2451-7250#2013', 'v8': 'president@fcu.edu.tw'},
    {'rep': '蔣立中', 'v3': '輔英科技大學', 'v5': '賴進興', 'v6': '研究暨產學發展處研發長', 'v7': '07-781-1151#2400', 'v8': 'PL019@fy.edu.tw'},
    {'rep': '林瑞德', 'v3': '輔仁大學', 'v5': '聶達安', 'v6': '副校長', 'v7': '02-2905-3177', 'v8': 'VPFM@mail.fju.edu.tw'},
    {'rep': '張錫正', 'v3': '華夏學校財團法人華夏科技大學', 'v5': '陳祐祥', 'v6': '研究發展處研發長', 'v7': '', 'v8': ''},
    {'rep': '李岡遠', 'v3': '臺北醫學大學', 'v5': '黃彥華', 'v6': '研究發展處研發長', 'v7': '02-2736-1661#7100', 'v8': 'leekangyun@tmu.edu.tw'},
    {'rep': '陳國雄', 'v3': '聖約翰科技大學', 'v5': '陸家樑', 'v6': '研究發展處研發長', 'v7': '02-2801-3131#6860', 'v8': 'kschen@mail.sju.edu.tw'},
    {'rep': '張文宇', 'v3': '聖約翰科技大學', 'v5': '黃宏斌', 'v6': '校長', 'v7': '02-2801-3131#6103', 'v8': 'changwy@mail.sju.edu.tw'},
    {'rep': '陳立言', 'v3': '聖母醫護管理專科學校', 'v5': '許壬榮', 'v6': '校長', 'v7': '', 'v8': 'president@smc.edu.tw'},
    {'rep': '洪耀釧', 'v3': '美和學校財團法人美和科技大學', 'v5': '李選', 'v6': '副校長', 'v7': '08-779-9821#8102', 'v8': 'x00010473@meiho.edu.tw'},
    {'rep': '王建臺', 'v3': '美和學校財團法人美和科技大學', 'v5': '翁順祥', 'v6': '校長', 'v7': '08-778-3428', 'v8': 'president@meiho.edu.tw'},
    {'rep': '邱明源', 'v3': '經國管理暨健康學院', 'v5': '翁進坪', 'v6': '校長', 'v7': '', 'v8': 'sec@ems.cku.edu.tw'},
    {'rep': '許輝煌', 'v3': '淡江大學學校財團法人淡江大學', 'v5': '何啟東', 'v6': '副校長', 'v7': '', 'v8': ''},
    {'rep': '林俊宏', 'v3': '淡江大學學校財團法人淡江大學', 'v5': '莊希豐', 'v6': '副校長', 'v7': '', 'v8': ''},
    {'rep': '陳小雀', 'v3': '淡江大學學校財團法人淡江大學', 'v5': '王高成', 'v6': '副校長', 'v7': '', 'v8': ''},
    {'rep': '陳明堂', 'v3': '樹人醫護管理專科學校', 'v5': '郭啟東', 'v6': '校長', 'v7': '07-697-9678', 'v8': 'mtchen@ms.szmc.edu.tw'},
    {'rep': '張國恩', 'v3': '東海大學', 'v5': '王茂駿', 'v6': '校長', 'v7': '04-2359-0200', 'v8': 'president@thu.edu.tw'},
    {'rep': '廖信德', 'v3': '明新學校財團法人明新科技大學', 'v5': '王舜睦', 'v6': '副校長', 'v7': '03-559-3142#1450', 'v8': 'liao@must.edu.tw'},
    {'rep': '曾俊傑', 'v3': '慈濟學校財團法人慈濟大學', 'v5': '黃舜平', 'v6': '研究發展處研發長', 'v7': '03-856#5301#1400', 'v8': 'tsengcc@mail.tcu.edu.tw'},
    {'rep': '曾國藩', 'v3': '慈濟學校財團法人慈濟大學', 'v5': '顏瑞鴻', 'v6': '副校長', 'v7': '', 'v8': ''},
    {'rep': '謝銀沙', 'v3': '康寧學校財團法人康寧大學', 'v5': '朱錦文', 'v6': '研究發展處研發長', 'v7': '02-2632-1181#107', 'v8': 'sophia@ukn.edu.tw'},
    {'rep': '陳清溪', 'v3': '康寧學校財團法人康寧大學', 'v5': '陳清溪 代理', 'v6': '校長', 'v7': '02-2632-1181#100', 'v8': 'chinhsi50@ukn.edu.tw'},
    {'rep': '賴峯民', 'v3': '大葉大學', 'v5': '吳宛玉', 'v6': '研究發展處研發長', 'v7': '04-851-1888#1760', 'v8': 'fengmin@mail.dyu.edu.tw'},
    {'rep': '顏鴻森', 'v3': '大葉大學', 'v5': '顏鴻森 代理', 'v6': '校長', 'v7': '04-851-1888#1000', 'v8': 'yanhs@mail.dyu.edu.tw'},
    {'rep': '温榮弘', 'v3': '大華學校財團法人敏實科技大學', 'v5': '劉玉山', 'v6': '研發處研發長', 'v7': '03-592-7700#2342', 'v8': 'aiwynn@o365.mitust.edu.tw'},
    {'rep': '吳柏萱', 'v3': '大同技術學院', 'v5': '王榮聖', 'v6': '校長', 'v7': '05-222-3124#612', 'v8': 'galingale@ms2.ttc.edu.tw'},
    {'rep': '吳明淏', 'v3': '國立高雄大學', 'v5': '吳松茂', 'v6': '研究發展處研發長', 'v7': '07-591-9100', 'v8': 'wuminhao@nuk.edu.tw'},
    {'rep': '袁菁', 'v3': '國立高雄大學', 'v5': '陳啓仁', 'v6': '副校長', 'v7': '07-591-9015', 'v8': 'caroline@nuk.edu.tw'},
    {'rep': '李宏仁', 'v3': '國立雲林科技大學', 'v5': '翁萬德', 'v6': '研究發展處研發長', 'v7': '05-534-2601#2500', 'v8': 'leehj@yuntech.edu.tw'},
    {'rep': '張文哲', 'v3': '國立臺灣海洋大學', 'v5': '李光敦', 'v6': '研究發展處研發長', 'v7': '02-2462-2192#2250', 'v8': 'wjchang@mail.ntou.edu.tw'},
    {'rep': '郭伯臣', 'v3': '國立臺中教育大學', 'v5': '王如哲', 'v6': '校長', 'v7': '04-2218-3128', 'v8': 'kbc@mail.ntcu.edu.tw'},
    {'rep': '魏希聖', 'v3': '國立臺北大學', 'v5': '衛萬明', 'v6': '研究發展處研發長', 'v7': '02-8674-1111#66148', 'v8': 'hswei@mail.ntpu.edu.tw'},
    {'rep': '王碩仁', 'v3': '國立臺南藝術大學', 'v5': '賴錫中', 'v6': '研究發展處研發長', 'v7': '06-693-0100#1800', 'v8': 'sjwang@tnnua.edu.tw'},
    {'rep': '鄭朝旭', 'v3': '中州學校財團法人中州科技大學', 'v5': '陳坤佐', 'v6': '研究發展處研發長', 'v7': '04-835-9000#1530', 'v8': 'chaohsu@dragon.ccut.edu.tw'},
    {'rep': '郭鐘達', 'v3': '中華學校財團法人中華科技大學', 'v5': '無 代理', 'v6': '校長', 'v7': '02-2782-1862#130', 'v8': 'sec@www.cust.edu.tw'},
    {'rep': '賴宗福', 'v3': '佛光大學', 'v5': '詹丕宗', 'v6': '研究發展處研發長', 'v7': '03-987-1000#12100', 'v8': 'cflai@mail.fgu.edu.tw'},
    {'rep': '廖慶榮', 'v3': '元智大學', 'v5': '吳志揚', 'v6': '校長', 'v7': '03-463-8800#2203', 'v8': 'ptdept@saturn.yzu.edu.tw'},
    {'rep': '徐澤志', 'v3': '元智大學', 'v5': '李清庭', 'v6': '副校長', 'v7': '03-463-8800#2209', 'v8': 'vpdept@saturn.yzu.edu.tw'},
    {'rep': '方士豪', 'v3': '元智大學', 'v5': '林錕松', 'v6': '研究發展處研發長', 'v7': '03-463-8800#7125', 'v8': 'shfang@saturn.yzu.edu.tw'},
    {'rep': '王綮慷', 'v3': '光宇學校財團法人元培醫事科技大學', 'v5': '林志城', 'v6': '校長', 'v7': '03-610-2201', 'v8': 'sec2201@mail.ypu.edu.tw'},
    {'rep': '黃政雄', 'v3': '光宇學校財團法人元培醫事科技大學', 'v5': '王綮慷', 'v6': '研究發展處研發長', 'v7': '03-610-2265', 'v8': 'chhuang@mail.ypu.edu.tw'},
    {'rep': '朱志良', 'v3': '南臺學校財團法人南臺科技大學', 'v5': '張鴻德', 'v6': '副校長', 'v7': '06-253-3131#1500', 'v8': 'cliang@stust.edu.tw'},
    {'rep': '林志鴻', 'v3': '南臺學校財團法人南臺科技大學', 'v5': '賴明材', 'v6': '副校長', 'v7': '06-253-3131#2100', 'v8': 'jhlin@stust.edu.tw'},
    {'rep': '林正敏', 'v3': '南開科技大學', 'v5': '許聰鑫', 'v6': '校長', 'v7': '049-256-3489#1201', 'v8': 'president.lcm@nkut.edu.tw'},
    {'rep': '王祥辰', 'v3': '國立中正大學', 'v5': '黃士銘', 'v6': '研究發展處研發長', 'v7': '05-272-0411#6000', 'v8': 'hcwang@ccu.edu.tw'},
    {'rep': '林翰謙', 'v3': '國立嘉義大學', 'v5': '艾群', 'v6': '校長', 'v7': '05-271-7100', 'v8': 'president@mail.ncyu.edu.tw'},
    {'rep': '陳瑞祥', 'v3': '國立嘉義大學', 'v5': '朱紀實', 'v6': '副校長', 'v7': '05-271-7037', 'v8': 'vicepresidentc@mail.ncyu.edu.tw'},
    {'rep': '張俊賢', 'v3': '國立嘉義大學', 'v5': '黃光亮', 'v6': '副校長', 'v7': '05-271-7198', 'v8': 'vicepresidenta@mail.ncyu.edu.tw'},
    {'rep': '李鴻文', 'v3': '國立嘉義大學', 'v5': '楊德清', 'v6': '副校長', 'v7': '05-271-7015', 'v8': 'vicepresidentb@mail.ncyu.edu.tw'},
    {'rep': '黃財尉', 'v3': '國立嘉義大學', 'v5': '徐善德', 'v6': '研究發展處研發長', 'v7': '05-271-7160', 'v8': 'twhuang@mail.ncyu.edu.tw'},
    {'rep': '陳威戎', 'v3': '國立宜蘭大學', 'v5': '李欣運', 'v6': '副校長', 'v7': '03-931-7002', 'v8': 'wjchen@niu.edu.tw'},
    {'rep': '張金龍', 'v3': '國立屏東科技大學', 'v5': '戴昌賢', 'v6': '校長', 'v7': '08-770-3660', 'v8': 'president@mail.npust.edu.tw'},
    {'rep': '馬上閔', 'v3': '國立屏東科技大學', 'v5': '羅希哲', 'v6': '副校長', 'v7': '08-774-0101', 'v8': 'masm@mail.npust.edu.tw'},
    {'rep': '林宗岐', 'v3': '國立彰化師範大學', 'v5': '王怡舜', 'v6': '研究發展處研發長', 'v7': '04-723-2105#1801 ', 'v8': 'cclin@cc.ncue.edu.tw'},
    {'rep': '李俊璋', 'v3': '國立成功大學', 'v5': '賴明德', 'v6': '副校長', 'v7': '06-275-7575#50055', 'v8': 'em50055@email.ncku.edu.tw'},
    {'rep': '李蔡彥', 'v3': '國立政治大學', 'v5': '郭明政', 'v6': '校長', 'v7': '02-2939-3091#62000', 'v8': 'president@nccu.edu.tw'},
    {'rep': '陳樹衡', 'v3': '國立政治大學', 'v5': '趙怡', 'v6': '副校長', 'v7': '02-2939-3091#67009', 'v8': 'ljshan@nccu.edu.tw'},
    {'rep': '詹志禹', 'v3': '國立政治大學', 'v5': '朱美麗', 'v6': '副校長', 'v7': '02-2939-3091#62300', 'v8': 'tu65@nccu.edu.tw'},
    {'rep': '蔡維奇', 'v3': '國立政治大學', 'v5': '王文杰', 'v6': '副校長', 'v7': '02-2939-3091#62599', 'v8': 'irene86@nccu.edu.tw'},
    {'rep': '吳筱玫', 'v3': '國立政治大學', 'v5': '倪鳴香', 'v6': '研究發展處研發長', 'v7': '', 'v8': ''},
    {'rep': '高為元', 'v3': '國立清華大學', 'v5': '賀陳弘', 'v6': '校長', 'v7': '03-516-2001', 'v8': 'presid@my.nthu.edu.tw'},
    {'rep': '簡禎富', 'v3': '國立清華大學', 'v5': '信世昌', 'v6': '副校長', 'v7': '03-571-5131#62503 ', 'v8': 'cfchien@mx.nthu.edu.tw'},
    {'rep': '邱博文', 'v3': '國立清華大學', 'v5': '曾繁根', 'v6': '研究發展處研發長', 'v7': '03-571-5131#35007', 'v8': 'pwchiu＠ee.nthu.edu.tw'},
    {'rep': '侯帝光', 'v3': '國立聯合大學', 'v5': '胡宣德', 'v6': '副校長', 'v7': '', 'v8': ''},
    {'rep': '王子奇', 'v3': '中國文化大學', 'v5': '徐興慶', 'v6': '校長', 'v7': '02-2861-0511#10105', 'v8': 'sywang@faculty.pccu.edu.tw '},
]


def main():
    df = pd.read_csv(f'{pwd}/單位主管_n1.csv', encoding='utf-8')
    df = Df(df)
    for d in delete:
        df.delRow(d)
    for a in add:
        df.addRow(a)
    for r in rep:
        df.repRow(r)
    df.df.to_csv(f'{pwd}/單位主管_n2.csv', encoding='utf-8-sig', index=False, mode='w+')


if __name__ == '__main__':
    main()
